{
  "index": {
    "section_1": "Experiencia Laboral",
    "section_2": "Proyectos",
    "section_3": "Sobre mí",
    "section_4": "Habilidades"
  },
  "aboutMe": {
    "p_1_1": "Soy Pedro y mi pasión por los videojuegos me impulsó a estudiar ",
    "p_1_2": "Ingeniería de Software",
    "p_1_3": ", lo que me ha permitido trabajar en diversos países. Esta experiencia me ha brindado una perspectiva global sobre los ",
    "p_1_4": " enfoques y metodologías ",
    "p_1_5": " para abordar los desafíos en el campo de la informática de manera innovadora.",

    "p_2_1": "A lo largo de este extenso recorrido, he tenido la oportunidad de llevar ",
    "p_2_2": "con éxito múltiples productos de 0 a 1.",
    "p_2_3": " He formado parte de diversos equipos de trabajo que, de manera efectiva y eficiente, hemos logrado garantizar ",
    "p_2_4": "resultados óptimos y duraderos.",

    "p_3_1": "Actualmente trabajo en el sector ",
    "p_3_2": "banking",
    "p_3_3": ", utilizando principalmente tecnologías como ",
    "p_3_4": "Java, groovy, AngularJs, base de datos (sql y nosql), Hibernate, etc."
  },
  "experience": {
    "item_4_date": "Agosto 2024 - Ahora",
    "item_4_title": "Full Stack Software Developer",
    "item_4_company": "AndXor",
    "item_4_description_1": "• Encargardo de la evolución y refactorización de la aplicación web Cloud2Sign, utilizando tecnologías como Spring Boot Framework y demas modulos de Spring Core, DataBases (Sql y No-Sql), Gradle y SVN.",

    "item_3_date": "Agosto 2018 - Julio 2024",
    "item_3_title": "Full Stack Software Developer",
    "item_3_company": "Sydema",
    "item_3_description_1": "• Analista de datos, desarrollador, evolución y mantenimiento de Laweb4. Aplicación web para el proceso de recuperación del crédito.",
    "item_3_description_2": "• Desarrollo de aplicaciones web utilizando tecnologías como JEE, Spring Framework, AngularJs, Solr, Redis, Groovy, Hibernate, Web Services, DataBases (Sql y No-Sql), Gradle y Git.",
    "item_3_description_3": "• Desarrollo de Procesos Batch para el transferimiento de datos de diferentes tipos de Data bases (Spring Batch, SqlLoader).",
    "item_3_description_4": "• Responsable de la gestión y mantenimiento de servidores Linux (RedHat), para el deploy de las aplicaciones.",

    "item_2_date": "Enero 2017 - Enero 2018",
    "item_2_title": "Junior Software Developer",
    "item_2_company": "Movistar",
    "item_2_description_1": "• Desarrollador de software de gestión de clientes, control de actividades y de rédito. Desarrollado principalmente en c++.",
    "item_2_description_2": "• Control, gestión y validación de los data bases de los clientes/proveedores (Sql server y MongoDB).",
    "item_2_description_3": "• Desarrollo e implementación de un software estadístico y probabilístico que genera ofertas a los posibles clientes. (Scripts dinámicos con Python).",
    "item_2_description_4": "• Gestión de los servicios implementados en Windows server.",
    "item_2_description_5": "• Producción de reportes semanales que indicaban los posibles targets a los cuales se ofrecerían los distintos servicios. (Generados con JasperReport).",

    "item_1_date": "Junio 2016 - Diciembre 2016",
    "item_1_title": "Practicante IT",
    "item_1_company": "SUNAT",
    "item_1_description_1": "• Gestión de los ingresos tributarios recaudados en el periodo 2016-II.",
    "item_1_description_2": "• Durante mi estancia en SUNAT he aprendido las bases de la organización de proyectos y aplicarlos a diferentes niveles en la lógica de algoritmos.",
    "item_1_description_3": "• Redacción de reportes utilizando querys para obtener el resultado deseado para el usuario final."
  },
  "footer": {
    "section_1": "Portfolio de Pedro",
    "section_2": "Sobre mí",
    "section_3": "Contactame"
  },
  "header": {
    "element_1_tittle": "Experiencia",
    "element_1_url": "/es/#experiencia",

    "element_2_tittle": "Proyectos",
    "element_2_url": "/es/#proyectos",

    "element_3_tittle": "Sobre mí",
    "element_3_url": "/es/#sobre-mi",

    "element_4_tittle": "Contacto",
    "element_4_url": "/es/#contacto",

    "element_5_tittle": "Habilidades",
    "element_5_url": "/es/#skills"
  },
  "LanguagesTable": {
    "language_table": "Idiomas",
    "language_table_show": "Mostrar",
    "language_table_hide": "Esconder",

    "language_es": "Español",
    "language_en": "Inglés",
    "language_it": "Italiano",
    "language_de": "Alemán",
    "language_lvl": "Lengua madre",

    "language_language": "Idioma",
    "language_listening": "Comprensión",
    "language_speaking": "Hablado",
    "language_writing": "Escritura"
  },
  "study": {
    "item_1_date": "Marzo 2012 - Enero 2017",
    "item_1_title": "Ingeniería de Software",
    "item_1_company": "Universidad Tecnológica del Perú (UTP)",
    "item_1_description_1": "• Control y gestión de datos informáticos y balance industrial.",
    "item_1_description_2": "• Especialización en la creación de algoritmos.",
    "item_1_description_3": "• Introducción al proceso lógico, habilidades y conocimientos para escribir software.",
    "item_1_description_4": "• Conocimiento de los procesos físicos, matemáticos y lógicos que permitan la simplificación de algunos procesos.",

    "item_2_date": "Enero 2013 - Diciembre 2015",
    "item_2_title": "Estudiante de Ingles",
    "item_2_company": "El Britanico",
    "item_2_description_1": "• Conocimiento profundo del idioma inglés con conocimiento apropiado de términos técnicos.",
    "item_2_description_2": "• Lenguaje fluido y claro.",
    "item_2_description_3": "• Desarrollo e implementación de un software estadístico y probabilístico que genera ofertas a los posibles clientes. (Scripts dinámicos con Python).",
    "item_2_description_4": "• En particular, durante el desarrollo de mis trabajos, siempre he tenido que tratar con hablantes nativos de inglés.",

    "item_3_date": "Marzo 2018 - Junio 2018",
    "item_3_title": "Certificación Oracle Java y Php",
    "item_3_company": "Pc Academy",
    "item_3_description_1": "Profundización y conocimiento del idioma en los detalles más específicos con el fin de actualizar mis conocimientos actuales.",

    "item_4_date": "Septiembre 2021 - Ahora",
    "item_4_title": "Ingeniería Informática",
    "item_4_company": "Politecnico di Milano",
    "item_4_description_1": "• Amplia gestión e infraestructura de base de datos.",
    "item_4_description_2": "• Especialización en desarrollo de software en lenguajes de bajo y alto nivel (Arquitectura de calculadoras y Sistemas operativos).",
    "item_4_description_3": "• Introducción al proceso lógico, habilidades y conocimientos para escribir software (Algoritmos y principios de la Informática).",
    "item_4_description_4": "• Economía y Organización Corporativa, desarrollo de cálculosprobabilísticos y estadística."
  },
  "me": {
    "me_hire": "Contratame",
    "me_intro_1": "Enfocado en actualizar, desarrollar e implementar productos con extra atención en los detalles.",
    "me_intro_2": "Especializado en soluciones de proyectos en aplicaciones únicas"
  },
  "projects": {
    "item_1_description_1": "Spring Batch es el estándar de facto para el procesamiento por lotes en JVM. Su implementación de patrones por lotes comunes, como el procesamiento y la partición basados en fragmentos, me permite crear aplicaciones por lotes escalables y de alto rendimiento que son lo suficientemente resistentes para sus procesos más críticos. De este modo, es posible popular un data base por medio de un archivo en entrada o gestionar tambien un reporte de una base de datos con una gran cantidad de información en ella.",

    "item_2_description_1": "Aplicacion que permite extraer información y responder preguntas de archivos PDF de gran tamaño, como manuales, ensayos y libros. ChatPDF analiza el PDF y la IA utilizará párrafos relevantes para darle una respuesta.",

    "item_3_description_1": {
      "description": "En este proyecto, se definen 5 microservicios que se comunican a través de OpenFeign. La versión del Spring Framework utilizada es 3.3.1, java17 LTS, Spring Data JPA, Spring Web, Spring Boot Actuator, Eureka, Mysql Driver, PostgreSQL Driver. Los microservicios son: ",
      "microservices": "microservice-gateway, microservice-config, microservice-course, microservice-student, microservice-eureka",
      "item_1": "• microservice-gateway: Se encarga de mapear y posteriormente exponer los endpoints que están definidos en los microservicios course & student (spring-cloud-starter-gateway)",
      "item_2": "• microservice-config : microservicio que permite la configuración de las propiedades de cada microservicio (spring-cloud-config-server)",
      "item_3": "• microservice-course: microservicio que materializa los datos de una base de datos Mysql, se comunica con el microservicio student a través de una llamada REST (spring-cloud-starter-openfeign)",
      "item_4": "• microservice-student: microservicio que materializa los datos de una base de datos PostgreSQL, se comunica con el microservicio course a través de una llamada REST (spring-cloud-starter-openfeign)",
      "item_5": "• microservice-eureka: microservicio que permite el registro y descubrimiento de los microservicios (spring-cloud-starter-netflix-eureka-server)"
    }
  },
  "skills": {
    "choose_theme": "Elegir Tema"
  }
}
